In [ ]:
import pandas as pd
import  numpy as np

In [1]:
data = {
    "Customer_ID": [1, 2, 3, 4, 5],
    "Hub_ID": [1, 2, 3, 4, 5],
    "Customer  _name": ["John", "Jane", "Jim", "Jill", "Jack"],
    " Cust_Contact No": [24565, 30677, 227778, 35777, 2866],
    "Address": ["Ambala", "Mumbai", "Karnataka", "kerla", "DElhi"],
}

In [4]:
import pandas as pd

df = pd.DataFrame(data)
df

   Customer_ID  Hub_ID Customer  _name   Cust_Contact No    Address
0            1       1            John             24565     Ambala
1            2       2            Jane             30677     Mumbai
2            3       3             Jim            227778  Karnataka
3            4       4            Jill             35777      kerla
4            5       5            Jack              2866      DElhi

In [6]:
import numpy as np

np.random.seed(41)
n = 3000
df = pd.DataFrame({
    "Customer_ID": np.random.randint(10, 20, n),
    "Hub_ID": np.random.randint(20, 80, n),
    "Customer  _name": np.random.choice(["John", "Jane", "Jim", "Jill", "Jack"], n),
    "Cust_Contact No": np.random.randint(20000, 90000, n),
    "Address": np.random.choice(["Ambala", "Mumbai"], n)
})

In [8]:
df = pd.DataFrame(data)
df

   Customer_ID  Hub_ID Customer  _name   Cust_Contact No    Address
0            1       1            John             24565     Ambala
1            2       2            Jane             30677     Mumbai
2            3       3             Jim            227778  Karnataka
3            4       4            Jill             35777      kerla
4            5       5            Jack              2866      DElhi